{
  "language": "it",
  "language_name": "italiano",
  "download_pdf": "scarica PDF",
  "name": "Antonio Colagreco",
  "job_title": "Sviluppatore Frontend",
  "avatar_alt": "Una foto di Antonio Colagreco",
  "description": "Sviluppatore frontend esperto ed appassionato, specializzato in React, Next.js e Gatsby. Creare interfacce utente intuitive e reattive è la mia specialità. Sfrutto tecnologie moderne per fornire soluzioni web di alta qualità che migliorano l'usabilità e l'esperienza utente. Competente in Next.js, posso integrare in maniera trasparente il rendering lato server e le funzionalità API per costruire applicazioni web robuste e dinamiche.",
  "mail_1": "nevenbridge@gmail.com",
  "mail_2": "antoniocolagreco@pec.it",
  "phone": "+39 320 705 4220",
  "address": "Pescara (PE), Italia",
  "google_map_url": "https://www.google.it/maps/place/Pescara",
  "linked_in": "linkedin.com/in/antonio-colagreco",
  "linked_in_url": "https://www.linkedin.com/in/antonio-colagreco",
  "skills": "Competenze",
  "problem_solving": "Risoluzione dei problemi",
  "collaboration": "Collaborazione",
  "creative_thinking": "Pensiero creativo",
  "time_management": "Gestione del tempo",
  "languages": "Conoscenza delle lingue",
  "italian": "italiano",
  "english": "inglese",
  "basic": "base",
  "intermediate": "intermedio",
  "advanced": "avanzato",
  "native": "madrelingua",
  "education": "Educazione",
  "educations_title": "Perito Informatico",
  "education_istitute": "ITIS Luigi di Savoia, Chieti (CH)",
  "recent_projects": "Progetti Recenti",
  "adkaora_image_alt": "Uno screenshot del sito web adkaora.com",
  "adkaora_project_description": "Ho costruito questo sito web da zero come progetto individuale utilizzando Gatsby e React, seguendo il design fornito dall'azienda. I contenuti del sito sono gestiti tramite un CMS headless, Contentful. Per garantire la conformità alle normative, ho implementato Iubenda, una soluzione completa per la conformità legale. Per l'autenticazione degli utenti, è stato utilizzato Amazon Cognito, che fornisce una funzionalità di accesso sicura e fluida. Inoltre, è stata integrata Google Analytics per fornire analisi dettagliate e approfondite.",
  "a2a_image_alt": "Uno screenshot del sito web a2aenergia.eu",
  "a2a_project_description": "Attraverso una collaborazione con hinto.com, ho sviluppato numerosi componenti frontend per il sito web utilizzando Gatsby e React. Questo progetto ha coinvolto un team di diverse persone e abbiamo utilizzato Figma e Jira per collaborare in maniera veloce e senza impedimenti. Il risultato è un sito web esteticamente gradevole e altamente funzionale che mette in mostra l'esperienza e la dedizione del team.",
  "work_experience": "Esperienza Lavorativa",
  "jobs": [
    {
      "role": "Sviluppatore Frontend",
      "company_name": "Freelance",
      "date": "2021 — ad oggi",
      "description": "Mentre lavoravo come assistente alle vendite, avevo deciso da tempo di tornare al mio campo professionale iniziale e avevo ripreso il mio percorso di formazione attraverso vari corsi su Udemy. E ora eccoci qui, sviluppando app e siti web."
    },
    {
      "role": "Specialista E-commerce",
      "company_name": "CheAutoRicambi SRL (Azienda familiare)",
      "date": "2012 — 2021",
      "description": "Il mio ruolo consisteva nel vendere pezzi di ricambio principalmente su eBay.it e Subito.it. Le mie responsabilità principali includevano la creazione e la gestione delle inserzioni, nonché il coordinamento logistico delle spedizioni. Un altro aspetto importante del mio ruolo era la gestione dei clienti e mi occupavo anche di compiti amministrativi e contabili."
    },
    {
      "role": "Sviluppatore Fullstack",
      "company_name": "RARA System SRL",
      "date": "2008 — 2011",
      "description": "Come sviluppatore fullstack, ero responsabile dello sviluppo di applicazioni web utilizzando il pattern MVC per clienti nel settore pubblico e bancario. Uno dei miei contributi significativi è stato quello di assistere nella creazione di chioschi informativi per la prenotazione di appuntamenti medici all'interno degli ospedali. Inoltre, ho svolto un ruolo cruciale nello sviluppo del framework interno dell'azienda utilizzato per la creazione di tutte le applicazioni web. Durante questa esperienza, ho principalmente lavorato con Java Server Faces, Spring e RichFaces."
    },
    {
      "role": "Fondatore",
      "company_name": "ITS di Antonio Colagreco",
      "description": "Vendita di computer e componenti, il punto vendita offriva anche servizi professionali di assemblaggio e supporto tecnico. L'azienda si occupava anche di installazione e configurazione di reti aziendali di piccole dimensioni.",
      "date": "2005 — 2007"
    },
    {
      "role": "Co-Fondatore",
      "company_name": "Samo Informatica SRL",
      "description": "Vendita di computer e componenti, il punto vendita offriva anche servizi professionali di assemblaggio e supporto tecnico. L'azienda si occupava anche di installazione e configurazione di reti aziendali di piccole dimensioni. L'azienda originale senza dipendete ma con con un socio.",
      "date": "2002 — 2005"
    }
  ],
  "privacy": {
    "title": "Informativa sulla Privacy",
    "description": "Gentile Utente, la presente informativa ha lo scopo di informarti che questo sito web, che mostra il curriculum di Antonio Colagreco, non raccoglie alcun dato personale dagli utenti e non utilizza cookie o archiviazione locale del browser.",
    "collection_of_personal_data": {
      "title": "Raccolta dei Dati Personali",
      "description": "Il sito web non richiede, raccoglie o memorizza alcun dato personale degli utenti. Non viene effettuata alcuna registrazione o richiesta di informazioni personali."
    },
    "use_of_cookies": {
      "title": "Utilizzo dei Cookie",
      "description": "Il sito web non utilizza cookie o altre tecnologie di tracciamento per raccogliere informazioni personali."
    },
    "local_browsers_storage": {
      "title": "Archiviazione Locale del Browser",
      "description": "Non viene effettuata alcuna archiviazione locale del browser (come localStorage o sessionStorage) per raccogliere o conservare dati personali."
    },
    "sharing_of_personal_data": {
      "title": "Condivisione dei Dati Personali",
      "description": "Poiché non vengono raccolti dati personali, non condivido o trasferisco tali informazioni a terze parti."
    },
    "data_security": {
      "title": "Sicurezza dei Dati",
      "description": "Non essendo raccolti dati personali, non sono previste misure di sicurezza specifiche. Tuttavia, adotto misure di sicurezza standard per proteggere il sito web da utilizzi impropri."
    },
    "changes_to_the_policy": {
      "title": "Modifiche all'Informativa",
      "description": "Mi riservo il diritto di apportare modifiche a questa informativa sulla privacy. Eventuali modifiche saranno pubblicate su questo stesso sito web."
    }
  },
  "cookie_policy": {
    "title": "Cookie Policy",
    "description": "Questo sito web non utilizza cookie o altre tecnologie di tracciamento per raccogliere informazioni personali degli utenti. Non vengono utilizzati cookie di sessione, cookie persistenti o altre tecnologie di tracciamento similari. Non effettuo alcun tracciamento o profilazione degli utenti attraverso questo sito web."
  },
  "scroll_to_top": "Torna all'inizio"
}

